sdaiRemoveByIterator(Sdai_ItrId*)
\details
Removes an aggregate instance that is referenced by a specified iterator.
\param iterator [in]  An iterator that refers to the current member of the aggregate.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiVT_NVLD - Value type invalid.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NSET - Aggregate instance is empty.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiIR_NEXS - Iterator does not exist.
* sdaiIR_NSET - Iterator has no current value.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance inst = sdaiCreateInstanceBN(model, "ifcbsplinesurfacewithknots");
SdaiAggr aggrCPCreated = sdaiCreateAggrBN(inst, "controlpointslist");
SdaiIterator it = sdaiCreateIterator(aggrCPCreated);
...
sdaiNext(it);
...
daiRemoveByIterator(it);
...